{
    "version": "https://jsonfeed.org/version/1",
    "title": "the reformed coder",
    "description": "",
    "home_page_url": "https://brountreers.github.io/publiisite",
    "feed_url": "https://brountreers.github.io/publiisite/feed.json",
    "user_comment": "",
    "author": {
        "name": "brian rountree"
    },
    "items": [
        {
            "id": "https://brountreers.github.io/publiisite/resume-of-brian-rountree.html",
            "url": "https://brountreers.github.io/publiisite/resume-of-brian-rountree.html",
            "title": "Resume of Brian Rountree",
            "summary": "BRIAN ROUNTREE, THE REFORMED CODEREXPERIENCED TECHNOLOGY LEADER275 Medford Street #504 Boston MA 02129 (+1) 210-850-9193 thepixelarchitect@yahoo.com Leading teams that drive impactful top level objectives forward. Hiring, mentoring, and developing individual contributors and the next generation of software development managers. March 2018 - current Associate Director&hellip;",
            "content_html": "<h1>BRIAN ROUNTREE, THE REFORMED CODER</h1>\n<h2>EXPERIENCED TECHNOLOGY LEADER</h2>\n<p class=\"address\">275 Medford Street #504 Boston MA 02129</p>\n<p class=\"address\">(+1) 210-850-9193</p>\n<p class=\"address\"><a href=\"mailto:thepixelarchitect@yahoo.com\">thepixelarchitect@yahoo.com</a></p>\n<h3>MY OBJECTIVES</h3>\n<p>Leading teams that drive impactful top level objectives forward.</p>\n<p>Hiring, mentoring, and developing individual contributors and the next generation of software development managers.</p>\n<h3>EXPERIENCE</h3>\n<p class=\"dates\">March 2018 - current</p>\n<p class=\"title\">Associate Director of Engineering</p>\n<p class=\"company\">Wayfair</p>\n<p>Leading the developmewnt efforts for systems and applications for handling customer post sales activities such as returns, cancellations, exchanges and delivery updates. In addition, I led the efforts for rebuilding and launching a new chat system for Wayfair support channels.</p>\n<p class=\"dates\">July 2017 - Jan 2018</p>\n<p class=\"title\">VP of Engineering</p>\n<p class=\"company\">Glympse</p>\n<p>Transitioned Glympse application stack from a .NET monolith over to a distributed, cloud native, microservices based set of applications. Refocused engineering on delivering higher quality software on a more predictable basis. Established a framework for engaging with the product team in a more structured way. Implemented the Desired Outcomes Framework as well as Dual Track Agile to bring increased focus and velocity to the engineering organization. Worked to simplify the AWS infrastructure to improve performance as well as reduce the monthly spend.</p>\n<p class=\"dates\">Oct 2016 - March 2017</p>\n<p class=\"title\">Sr Engineering Manager</p>\n<p class=\"company\">Amazon Web Services</p>\n<p>Supported the engineering efforts for the AWS Mobile Hub product and the AWS Device Farm product.</p>\n<p>Streamlined the build and deployment process to be able to deliver updated mobile SDKs in sync with product releases from across the AWS portfolio of services.</p>\n<p>Supported the engineering efforts to build out enterprise capabilities for ZenDesk, Microsoft Dynamics, Workday and SAP in the AWS Mobile Hub and Mobile SDKs.</p>\n<p>Launched full support for voice-to-text and text-to-voice APIs and SDKs to coincide with the AWS re:INVENT launches of voice and Alexa support in 2016</p>\n<p class=\"dates\">Oct 2014 - Oct 2016</p>\n<p class=\"title\">Director of Engineering</p>\n<p class=\"company\">Hewlett Packard</p>\n<p>Oversaw all of the User Interface engineering across all of the HP Helion Cloud products, as well as the Developer Experience efforts: SDKs, CLIs, IDE integrations, Developer Portal and Cloud Services Marketplace.</p>\n<p>Areas of focus included leading development teams working with customers and the community on the OpenStack Horizon Dashboard Project. and the HPE NFV Cloud.</p>\n<p>Provided technical leadership for the rewrite of the the Horizon codebase in AngularJS. Project Technical lead for the OpenStack Searchlight project. Led the development efforts for HP’s CloudSuite management application stack.</p>\n<p class=\"dates\">Jan 2011 - Oct 2015</p>\n<p class=\"title\">Director of Engineering</p>\n<p class=\"company\">Rackspace</p>\n<p>Led multiple cross functional teams responsible for building out scalable, highly distributed web applications to enable Rackspace staff to deliver “Fanatical Support” to customers. Built out a fully staffed and capable Product Management team, six engineering teams, a user experience group, and a devops team. Utilizing cutting edge technologies like MongoDB, Elasticsearch and AngularJS, these teams rebuilt our support tools from scratch.</p>\n<p>Was asked by senior leadership to step in and assist the then nascent Rackspace Developer Relations Group. Immediately saw to the creation of actionable metrics to ensure everyone understood what success looked like before starting to scale the team. By focusing on key hires in the industry, I assembled a top-notch team of SDK authors, Evangelists, and API Documentation specialists and grew the DRG from 3 to 28 in nine months.</p>\n<p>Oversaw the design and initial build of developer.rackspace.com. Led the release of SDKs and starter kits for the Rackspace Open Cloud in Python, Ruby, .NET, Node, Java and PHP. Oversaw the budget and travel of the evangelists speaking at conferences around the world</p>\n<p class=\"dates\">2005 - 2010</p>\nS\n<p class=\"title\">enior Software Architect +multiple other roles</p>\n<p class=\"company\">YAHOO!</p>\n<p>Oversaw the technical architecture for all of Yahoo’s Open Social initiatives. Ensured stakeholders were updated, managed global release cycles and maintained zero downtime updates with no breaking API changes downstream.</p>\n<p>Led the creation of code, documentation, UI assets and style guides to support the relaunch of Yahoo Finance. Upon completion, Yahoo had one code base, supporting 24 languages, globally deployed across 8 datacenters and generating 4+ billion pageviews per day on average.</p>\n<p>Oversaw the front end engineering efforts in the creation of brand new, services based media properties such as Yahoo Shine and Yahoo Tech.</p>\n<p>Worked as part of a special Yahoo Media Engineering skunk works development team assigned to build out features and packages across the media properties that fell outside of the capabilities of the existing teams. Examples included a global blogging platform for Yahoo users, free, real-time stock quotes on Yahoo Finance and the first version of what would become Yahoo Fantasy Sports</p>\n<h3>STRENGTHS</h3>\n<ul>\n<li>Input</li>\n<li>Activator</li>\n<li>Relator</li>\n<li>Arranger</li>\n<li>Includer</li>\n</ul>\n<h3>SKILLS</h3>\n<ul>\n<li>Leadership</li>\n<li>Agile Development</li>\n<li>Hiring &amp; Retention</li>\n<li>Public Speaking</li>\n<li>Software Development</li>\n<li>Scaling Systems</li>\n<li>Cloud Native Development</li>\n<li>Quality</li>\n<li>Large Distributed Systems</li>\n</ul>\n<h3>LANGUAGES</h3>\n<ul>\n<li>HTML</li>\n<li>CSS</li>\n<li>Javascript\n<ul>\n<li>vanilla</li>\n<li>jquery</li>\n<li>node</li>\n</ul>\n</li>\n<li>XSLT</li>\n<li>Python</li>\n<li>PHP</li>\n<li>Go</li>\n</ul>\n<h3>INFRASTRUCTURE</h3>\n<ul>\n<li>OpenStack</li>\n<li>Cloud Foundry</li>\n<li>AWS</li>\n<li>Azure</li>\n<li>Rackspace Cloud</li>\n</ul>\n<h3>INTERESTS</h3>\n<ul>\n<li>Community Service</li>\n<li>Molecular Gastronomy</li>\n<li>Motion Graphics</li>\n<li>Mentoring New Managers</li>\n<li>Generative Art</li>\n<li>Open Source Software Development</li>\n<li>MK1 Sciroccos</li>\n<li>Vector Illustrations</li>\n<li>Motion Design</li>\n<li>Mixology</li>\n<li>Making Ginger Beer</li>\n<li>Data Visualization</li>\n</ul>",
            "image": "https://brountreers.github.io/publiisite/media/posts/2/",
            "author": {
                "name": "brian rountree"
            },
            "tags": [
            ],
            "date_published": "2018-11-05T08:37:33-05:00",
            "date_modified": "2018-11-05T08:37:33-05:00"
        },
        {
            "id": "https://brountreers.github.io/publiisite/testing-testing-1-2-3.html",
            "url": "https://brountreers.github.io/publiisite/testing-testing-1-2-3.html",
            "title": "testing, testing, 1, 2, 3",
            "summary": "Tote bag selfies celiac sartorial fashion axe, venmo man bun pabst pork belly green juice. Vegan hot chicken coloring book beard williamsburg, waistcoat disrupt intelligentsia butcher lomo tumeric enamel pin tumblr bicycle rights af. Iceland direct trade normcore typewriter live-edge. YOLO bushwick hashtag fingerstache food&hellip;",
            "content_html": "<div class=\"anyipsum-output\">\n<p>Tote bag selfies celiac sartorial fashion axe, venmo man bun pabst pork belly green juice. Vegan hot chicken coloring book beard williamsburg, waistcoat disrupt intelligentsia butcher lomo tumeric enamel pin tumblr bicycle rights af. Iceland direct trade normcore typewriter live-edge. YOLO bushwick hashtag fingerstache food truck.</p>\n<p>wolf moon taxidermy literally godard affogato gastropub. Franzen mumblecore prism +1, hashtag wolf banh mi thundercats actually twee cold-pressed shoreditch direct trade bitters. Art party yuccie ugh blue bottle occupy, meh semiotics gastropub. Stumptown pinterest brooklyn, fixie 8-bit prism PBR&amp;B drinking vinegar live-edge hell of taiyaki hexagon. Cred franzen pinterest banh mi VHS helvetica, deep v ennui. Prism venmo ethical sriracha.</p>\n<p>Lomo kale chips tousled four loko. Poke waistcoat swag woke skateboard. Slow-carb intelligentsia snackwave before they sold out. Bespoke listicle PBR&amp;B tofu, butcher heirloom chambray. Sriracha actually hoodie williamsburg lomo succulents celiac flexitarian hot chicken meggings 3 wolf moon poke. Salvia wayfarers asymmetrical, fanny pack raclette put a bird on it photo booth live-edge sustainable bespoke.</p>\n<p>Polaroid neutra lo-fi viral cronut letterpress kale chips butcher quinoa meditation yuccie. Unicorn tote bag gochujang cliche gentrify paleo 90's kickstarter butcher keffiyeh celiac hexagon selfies chia poke. Swag palo santo gastropub, forage hella lyft plaid selfies portland blue bottle messenger bag you probably haven't heard of them. Mixtape helvetica PBR&amp;B crucifix pickled, truffaut farm-to-table enamel pin four loko palo santo dreamcatcher sartorial green juice godard.</p>\n<p>Selfies live-edge readymade, letterpress try-hard mixtape palo santo echo park pickled. Portland literally health goth locavore XOXO actually. Coloring book letterpress intelligentsia knausgaard kickstarter poke artisan lyft irony kogi godard thundercats marfa. Succulents kinfolk 90's, palo santo schlitz typewriter whatever tacos. Vaporware sriracha actually snackwave, chicharrones aesthetic twee intelligentsia portland iceland craft beer prism waistcoat chia. Mumblecore affogato brooklyn master cleanse etsy before they sold out, PBR&amp;B helvetica lomo.</p>\n</div>",
            "image": "https://brountreers.github.io/publiisite/media/posts/1/",
            "author": {
                "name": "brian rountree"
            },
            "tags": [
            ],
            "date_published": "2018-11-04T15:58:11-05:00",
            "date_modified": "2018-11-04T15:58:11-05:00"
        }
    ]
}
